Repository: farhan4783/kunark-learn
Catalog: lib/l10n/intl_*.arb
Languages: or

# appName
source: Konark Learn
or: କୋଣାର୍କ ଲର୍ଣ୍ଣ

source: Home
or: ହୋମ୍

source: Dashboard
or: ଡ୍ୟାଶବୋର୍ଡ

source: Achievements
or: କୃତିତ୍ୱ

source: Profile
or: ପ୍ରୋଫାଇଲ୍

# changeLanguage
source: Language
or: ଭାଷା

# greetingUser
source: Good {timeOfDay}, {userName}!
or: ଶୁଭ {timeOfDay}, {userName}!

# goodMorning
source: Morning
or: ସକାଳ

# goodAfternoon
source: Afternoon
or: ଅପରାହ୍ନ

# goodEvening
source: Evening
or: ସନ୍ଧ୍ୟା

# homeWelcomeSubtitle
source: What would you like to learn today?
or: ଆଜି ଆପଣ କ'ଣ ଶିଖିବାକୁ ଚାହାଁନ୍ତି?

source: Today's Challenge
or: ଆଜିର ଚ୍ୟାଲେଞ୍ଜ

# todaysChallengeSubtitle
source: Try the 'Math Quiz' in the Games section!
or: ଖେଳ ବିଭାଗରେ 'ଗଣିତ କୁଇଜ୍' ଚେଷ୍ଟା କରନ୍ତୁ!

source: Let's get learning
or: ଚାଲନ୍ତୁ ଶିଖିବା

source: Lessons
or: ପାଠ

source: Games
or: ଖେଳ

source: AI Helper
or: AI ସହାୟକ

source: Tasks
or: କାର୍ଯ୍ୟ

source: Explore All Subjects
or: ସମସ୍ତ ବିଷୟ ଅନୁସନ୍ଧାନ କରନ୍ତୁ

source: My Progress
or: ମୋର ପ୍ରଗତି

source: Course Completion
or: ପାଠ୍ୟକ୍ରମ ସମାପ୍ତି

source: Current Course
or: ବର୍ତ୍ତମାନ ପାଠ୍ୟକ୍ରମ

source: Next Lesson
or: ପରବର୍ତ୍ତୀ ପାଠ

# sustainableFarming
source: Sustainable Farming Practices
or: ସ୍ଥାୟୀ କୃଷି ଅଭ୍ୟାସ

# cropRotation
source: Crop Rotation Techniques
or: ଫସଲ ଘୁର୍ଣ୍ଣନ କୌଶଳ

source: Available Courses
or: ଉପଲବ୍ଧ ପାଠ୍ୟକ୍ରମ

source: Organic Agriculture
or: ଜୈବ କୃଷି

source: Livestock Management
or: ପଶୁଧନ ପରିଚାଳନା

# agriBusiness
source: Agri-Business Basics
or: କୃଷି-ବ୍ୟବସାୟ ମୌଳିକ

source: Community Forum
or: ସମୁଦାୟ ଫୋରମ

# forumDiscussion
source: Discussion: Pest Control Tips
or: ଆଲୋଚନା: କୀଟନାଶକ ନିୟନ୍ତ୍ରଣ ଟିପ୍ସ

# forumNewPost
source: New Post: Share Your Harvest!
or: ନୂତନ ପୋଷ୍ଟ: ଆପଣଙ୍କର ଅମଳ ବାଣ୍ଟନ୍ତୁ!

source: Learning Resources
or: ଶିକ୍ଷଣ ସମ୍ବଳ

source: Video Tutorials
or: ଭିଡିଓ ଟ୍ୟୁଟୋରିଆଲ

source: Downloadable Guides
or: ଡାଉନଲୋଡଯୋଗ୍ୟ ଗାଇଡ

source: Expert Q&A
or: ବିଶେଷଜ୍ଞ Q&A

source: Calendar & Events
or: କ୍ୟାଲେଣ୍ଡର ଏବଂ ଇଭେଣ୍ଟ

source: Workshop
or: କର୍ମଶାଳା

source: Field Trip
or: କ୍ଷେତ୍ର ଭ୍ରମଣ

source: Courses
or: ପାଠ୍ୟକ୍ରମ

source: Community
or: ସମୁଦାୟ

source: Subjects
or: ବିଷୟସମୂହ

source: Educational Games
or: ଶିକ୍ଷାମୂଳକ ଖେଳ

source: Math Quiz
or: ଗଣିତ କୁଇଜ୍

source: Word Puzzle
or: ଶବ୍ଦ ପଜଲ୍

source: Memory Match
or: ସ୍ମୃତି ମିଳନ

source: Geography Challenge
or: ଭୂଗୋଳ ଚ୍ୟାଲେଞ୍ଜ

# testArithmetic
source: Test your arithmetic and problem-solving skills.
or: ଆପଣଙ୍କ ଅଙ୍କଗଣିତ ଏବଂ ସମସ୍ୟା ସମାଧାନ କୌଶଳ ପରୀକ୍ଷା କରନ୍ତୁ।

# findHiddenWords
source: Find the hidden words and expand your vocabulary.
or: ଲୁଚିଥିବା ଶବ୍ଦ ଖୋଜନ୍ତୁ ଏବଂ ଆପଣଙ୍କ ଶବ୍ଦଭଣ୍ଡାର ବଢ଼ାନ୍ତୁ।

# improveMemory
source: Improve your memory by matching pairs.
or: ଯୋଡ଼ା ମିଳାଇ ଆପଣଙ୍କ ସ୍ମୃତିକୁ ଉନ୍ନତ କରନ୍ତୁ।

# knowWorld
source: How well do you know the world? Find out now!
or: ଆପଣ ବିଶ୍ୱକୁ କେତେ ଭଲ ଜାଣନ୍ତି? ଏବେ ଜାଣନ୍ତୁ!

# comingSoon
source: is coming soon!
or: ଶୀଘ୍ର ଆସିବ!

# quizDownloaded
source: Quiz downloaded successfully!
or: କୁଇଜ୍ ସଫଳତାପୂର୍ବକ ଡାଉନଲୋଡ୍ ହୋଇଛି!

# downloadingQuiz
source: Generating and downloading quiz...
or: କୁଇଜ୍ ସୃଷ୍ଟି ଏବଂ ଡାଉନଲୋଡ୍ ହେଉଛି...

# failedDownload
source: Failed to download quiz:
or: କୁଇଜ୍ ଡାଉନଲୋଡ୍ ବିଫଳ:

source: Topics
or: ବିଷୟବସ୍ତୁ

# noTopics
source: No topics found for this subject.
or: ଏହି ବିଷୟ ପାଇଁ କୌଣସି ବିଷୟବସ୍ତୁ ମିଳିଲା ନାହିଁ।

source: Menu Book
or: ମେନୁ ବହି

# memoryMatchDesc
source: Improve your memory by matching pairs.
or: ଯୋଡ଼ା ମିଳାଇ ଆପଣଙ୍କ ସ୍ମୃତିକୁ ଉନ୍ନତ କରନ୍ତୁ।

# wordPuzzleDesc
source: Arrange letters to form words.
or: ଅକ୍ଷରଗୁଡ଼ିକୁ ବ୍ୟବସ୍ଥାପିତ କରି ଶବ୍ଦ ଗଠନ କରନ୍ତୁ।

source: Quiz Game
or: କୁଇଜ୍ ଗେମ୍

# quizGameDesc
source: Test your knowledge with quizzes.
or: କୁଇଜ୍ ସହିତ ଆପଣଙ୍କ ଜ୍ଞାନ ପରୀକ୍ଷା କରନ୍ତୁ।

source: Flashcard Game
or: ଫ୍ଲ୍ୟାଶକାର୍ଡ୍ ଗେମ୍

# flashcardGameDesc
source: Learn with flashcards.
or: ଫ୍ଲ୍ୟାଶକାର୍ଡ୍ ସହିତ ଶିଖନ୍ତୁ।

source: Topic Matching
or: ଟୋପିକ୍ ମ୍ୟାଚିଂ

# topicMatchingDesc
source: Match topics with their descriptions.
or: ବିଷୟବସ୍ତୁକୁ ସେମାନଙ୍କର ବର୍ଣ୍ଣନା ସହିତ ମିଳାନ୍ତୁ।

# mathMonsterBattleDesc
source: Battle monsters with math questions.
or: ଗଣିତ ପ୍ରଶ୍ନ ସହିତ ରାକ୍ଷସମାନଙ୍କୁ ଯୁଦ୍ଧ କରନ୍ତୁ।

source: Sign in
or: ସାଇନ୍ ଇନ୍

source: Sign up
or: ସାଇନ୍ ଅପ୍

# playLearnAchieve
source: Play Learn Achieve More
or: ଖେଳନ୍ତୁ ଶିଖନ୍ତୁ ଅଧିକ ଅର୍ଜନ କରନ୍ତୁ

source: Get Started
or: ଆରମ୍ଭ କରନ୍ତୁ

source: Email
or: ଇମେଲ୍

source: Password
or: ପାସୱାର୍ଡ୍

source: Confirm Password
or: ପାସୱାର୍ଡ୍ ନିଶ୍ଚିତ କରନ୍ତୁ

source: Name
or: ନାମ

source: Login
or: ଲଗ୍ଇନ୍

source: Register
or: ନିବନ୍ଧନ

# dontHaveAccount
source: Don't have an account?
or: ଆପଣଙ୍କର ଏକ ଏକାଉଣ୍ଟ୍ ନାହିଁ?

# alreadyHaveAccount
source: Already have an account?
or: ପહିଲାରୁ ଏକ ଏକାଉଣ୍ଟ୍ ଅଛି?

source: Login failed
or: ଲଗ୍ଇନ୍ ବିଫଳ

source: Registration failed
or: ନିବନ୍ଧନ ବିଫଳ

source: User not found
or: ଉପଭୋକ୍ତା ମିଳିଲା ନାହିଁ

source: Wrong password
or: ଭୁଲ୍ ପାସୱାର୍ଡ୍

source: Email already in use
or: ଇମେଲ୍ ପહିଲାରୁ ବ୍ୟବହାର ହୋଇଛି

source: Weak password
or: ଦୁର୍ବଳ ପାସୱାର୍ଡ୍

source: Invalid email
or: ଅବୈଧ ଇମେଲ୍

source: Chat with AI
or: AI ସହିତ ଚାଟ୍

# mickeyAIHelper
source: Mickey Your AI Helper
or: ମିକି ଆପଣଙ୍କ AI ସହାୟକ

# askMickey
source: Ask Mickey anything!
or: ମିକିଙ୍କୁ ଯେକୌଣସି ପଚାରନ୍ତୁ!

# mickeyWelcome
source: Hi there, future genius! I'm Mickey, your friendly AI Helper. What exciting things do you want to learn about today?
or: ହେଲୋ, ଭବିଷ୍ୟତର ବିଦ୍ୱାନ୍! ମୁଁ ମିକି, ଆପଣଙ୍କ ବନ୍ଧୁମାନଙ୍କ AI ସହାୟକ। ଆଜି ଆପଣ କଣ ରୋମାଞ୍ଚକର ବିଷୟ ଶିଖିବାକୁ ଚାହାଁନ୍ତି?

# apiKeyError
source: Oops! My AI brain isn't connected. Please check your API Key!
or: ଓହ୍! ମୋର AI ମସ୍ତିଷ୍କ ସଂଯୋଗିତ ହୋଇନାହିଁ। ଦୟାକରି ଆପଣଙ୍କ API କୀ ଯାଞ୍ଚ କରନ୍ତୁ!

# didNotCatch
source: I didn't quite catch that. Could you please rephrase?
or: ମୁଁ ଏହାକୁ ଭଲଭାବେ ବୁଝିପାରିଲି ନାହିଁ। ଦୟାକରି ପୁନର୍ବାର କହନ୍ତୁ?

# somethingWrong
source: Oops! Something went wrong:
or: ଓହ୍! କିଛି ଭୁଲ୍ ହୋଇଗଲା:

source: Mickey
or: ମିକି

source: You
or: ଆପଣ

# typeMessage
source: Type your message...
or: ଆପଣଙ୍କ ମେସେଜ୍ ଟାଇପ୍ କରନ୍ତୁ...

source: Send
or: ପଠାନ୍ତୁ

source: My Tasks
or: ମୋର କାର୍ଯ୍ୟସୂଚୀ

source: Add Task
or: କାର୍ଯ୍ୟ ଯୋଡ଼ନ୍ତୁ

source: Task Title
or: କାର୍ଯ୍ୟ ଶୀର୍ଷକ

source: Task Description
or: କାର୍ଯ୍ୟ ବର୍ଣ୍ଣନା

source: Save
or: ସଂରକ୍ଷଣ

source: Cancel
or: ରଦ୍

source: Delete
or: ହରାଇଥାନ୍ତୁ

source: Edit
or: ସମ୍ପାଦନା

source: My Achievements
or: ମୋର କୃତିତ୍ୱ

source: Completed Lessons
or: ସମାପ୍ତ ପାଠ

source: Completed Quizzes
or: ସମାପ୍ତ କୁଇଜ୍

source: Earned Points
or: ଅର୍ଜିତ ପଏଣ୍ଟ୍

source: My Profile
or: ମୋର ପ୍ରୋଫାଇଲ୍

source: Offline Lessons
or: ଅଫ୍ଲାଇନ୍ ପାଠ

source: Offline Quizzes
or: ଅଫ୍ଲାଇନ୍ କୁଇଜ୍

source: Settings
or: ସେଟିଂଗ୍ସ

source: Logout
or: ଲଗ୍ଆଉଟ୍

source: Generating lesson...
or: ପାଠ ସୃଷ୍ଟି ହେଉଛି...

# lessonGenerated
source: Lesson generated successfully!
or: ପାଠ ସଫଳତାପୂର୍ବକ ସୃଷ୍ଟି ହୋଇଛି!

# failedGenerateLesson
source: Failed to generate lesson:
or: ପାଠ ସୃଷ୍ଟି ବିଫଳ:

# quizLoading
source: Loading Quiz...
or: କୁଇଜ୍ ଲୋଡ୍ ହେଉଛି...

source: Start Quiz
or: କୁଇଜ୍ ଆରମ୍ଭ କରନ୍ତୁ

source: Next
or: ପରବର୍ତ୍ତୀ

source: Previous
or: ପୂର୍ବବର୍ତ୍ତୀ

source: Finish
or: ସମାପ୍ତ

source: Correct!
or: ସଠିକ୍!

source: Incorrect!
or: ଭୁଲ୍!

source: Your Score:
or: ଆପଣଙ୍କ ସ୍କୋର୍:

source: Math Monster Battle
or: ଗଣିତ ରାକ୍ଷସ ଯୁଦ୍ଧ

# levelAddition
source: Level 1: Addition
or: ଲେଭେଲ୍ ୧: ଯୋଗ

# levelFractions
source: Level 2: Fractions
or: ଲେଭେଲ୍ ୨: ଭାଗ

# levelMixed
source: Level 3: Mixed Problems
or: ଲେଭେଲ୍ ୩: ମିଶ୍ର ସମସ୍ୟା

# defeatedMonsters
source: You defeated all monsters!
or: ଆପଣ ସମସ୍ତ ରାକ୍ଷସମାନଙ୍କୁ ପରାସ୍ତ କରିଛନ୍ତି!

# greatJob
source: Great job, Math Hero!
or: ବଢ଼ିଆ କାମ୍, ଗଣିତ ହୁଇରୋ!
